jliphard/wearable_nRF52_Firmware/main.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            NRF_LOG_INFO("Fast advertising.\r\n");
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_ADV_EVT_IDLE:
            //keep going!!!!!!! JTL
            //sleep_mode_enter();
            break;

        default:
            break;
    }
}

/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    //SEGGER_RTT_WriteString(0, "On_ble_evt\n");
    //SEGGER_RTT_printf(0, "Type1: %d\n", p_ble_evt->header.evt_id);
    
    switch (p_ble_evt->header.evt_id)
    {
        //SEGGER_RTT_WriteString(0, "Write request");
        //SEGGER_RTT_printf(0, "Type2: %d\n", p_ble_evt->header.evt_id);
        
        //Type 16
        case BLE_GAP_EVT_CONNECTED:
            SEGGER_RTT_WriteString(0, "BLE_GAP_EVT_CONNECTED\n");
            //NRF_LOG_INFO("Connected.\r\n");
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            break; // BLE_GAP_EVT_CONNECTED

        //Type 17
        case BLE_GAP_EVT_DISCONNECTED:
             SEGGER_RTT_WriteString(0, "BLE_GAP_EVT_DISCONNECTED\n");
            //NRF_LOG_INFO("Disconnected, reason %d.\r\n", p_ble_evt->evt.gap_evt.params.disconnected.reason);
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break; // BLE_GAP_EVT_DISCONNECTED

        case BLE_GATTC_EVT_TIMEOUT:
             SEGGER_RTT_WriteString(0, "BLE_GATTC_EVT_TIMEOUT\n");
            // Disconnect on GATT Client timeout event.
            //NRF_LOG_DEBUG("GATT Client Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTC_EVT_TIMEOUT

        case BLE_GATTS_EVT_TIMEOUT:
             SEGGER_RTT_WriteString(0, "BLE_GATTS_EVT_TIMEOUT\n");
            // Disconnect on GATT Server timeout event.
            //NRF_LOG_DEBUG("GATT Server Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_TIMEOUT

        case BLE_GATTS_EVT_WRITE:
            
            //this is for all data coming back from phone.....
            SEGGER_RTT_WriteString(0, "BLE_GATTS_EVT_WRITE\n");
            
            //uint8_t new_hex_status = 0;
            
            uint8_t * p_data = p_ble_evt->evt.gatts_evt.params.write.data;
            //uint16_t length  = p_ble_evt->evt.gatts_evt.params.write.len;
            uint8_t new_command = p_data[0];
            
            SEGGER_RTT_printf(0, "New command: %d\r\n", new_command);
            
            if( new_command == 32 )
            {
                SaveToFLASH = false;
                SEGGER_RTT_WriteString(0, "Turning OFF save to FLASH\n");
            } 
            else if ( new_command == 33 )
            {
                SaveToFLASH = true;
                SEGGER_RTT_WriteString(0, "Turning ON save to FLASH\n");
            }
            else if ( new_command == 12 )
            {
                SampleSensors = false;
                SEGGER_RTT_WriteString(0, "Turning OFF sampling\n");
            }
            else if ( new_command == 13 )
            {
                SampleSensors = true;
                SEGGER_RTT_WriteString(0, "Turning ON sampling\n");
            }
            //ok, so what is the value of the characteristic now?
            /*
             err_code = ble_hrs_heart_rate_measurement_send_MAP(&m_hrs, heartbeat16, battery_level8, 
                                                                BMP280P8, BMP280T8, BMP280H8, 
                                                                resultVME[3], 
                                                                resultBMA[0], resultBMA[1], resultBMA[2]);
             
             
             */
            //print it out.....
            break; // BLE_GATTS_EVT_TIMEOUT
            
        case BLE_EVT_USER_MEM_REQUEST:
            SEGGER_RTT_WriteString(0, "BLE_EVT_USER_MEM_REQUEST\n");
            err_code = sd_ble_user_mem_reply(m_conn_handle, NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_EVT_USER_MEM_REQUEST

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            SEGGER_RTT_WriteString(0, "BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST\n");
            
            ble_gatts_evt_rw_authorize_request_t req;
            ble_gatts_rw_authorize_reply_params_t auth_reply;

            req = p_ble_evt->evt.gatts_evt.params.authorize_request;

            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                        SEGGER_RTT_WriteString(0, "BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST - Write\n");
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                        SEGGER_RTT_WriteString(0, "BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST - Read\n");
                    }
                    auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    APP_ERROR_CHECK(err_code);
                }
            }
        } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST


        default:
            //SEGGER_RTT_WriteString(0, "Default - some other number that is not handled\n");
            // No implementation needed.
            break;
    }
}

/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the BLE Stack event interrupt handler after a BLE stack
 *          event has been received.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    //SEGGER_RTT_WriteString(0, "ble_evt_dispatch\n");
    ble_conn_state_on_ble_evt(p_ble_evt);
    pm_on_ble_evt(p_ble_evt);
    ble_hrs_on_ble_evt(&m_hrs, p_ble_evt);
    ble_bas_on_ble_evt(&m_bas, p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
    bsp_btn_ble_on_ble_evt(p_ble_evt);
    on_ble_evt(p_ble_evt);
    ble_advertising_on_ble_evt(p_ble_evt);
    nrf_ble_gatt_on_ble_evt(&m_gatt, p_ble_evt);
}

/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in] sys_evt  System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    // Dispatch the system event to the fstorage module, where it will be
    // dispatched to the Flash Data Storage (FDS) module.
    fs_sys_event_handler(sys_evt);

