jliphard/wearable_nRF52_Firmware/main.c
}

static void timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    //SEGGER_RTT_WriteString(0, "TH.\n"); 
    update_fast();
}

int main(void)
{
    SEGGER_RTT_WriteString(0, "\n\n***********\n");
    
    RTC1_timer_init();
    leds_init();
    
    bool erase_bonds = true;
    //buttons_leds_init(&erase_bonds);
    
    if( 1 == 2 ) {
        lfclk_request(); // Request LF clock - needed when softdevice is off
    } else {
        ble_stack_init(); //fire up the softdevice
    }
        
    gap_params_init();
    gatt_init();
    advertising_init();
    ble_services_init();
    conn_params_init();
    peer_manager_init();
    
    //ADC subsystem 
    ADC_init();
        
    //I2C bus. 
    I2C_init();
    
    //BME280 init. 
    BME280_Turn_On();

    nrf_delay_ms(500);
    
    VEML6040_Turn_On();
    
    nrf_delay_ms(500);
    
    BMA280_Turn_On_Fast();
    
    nrf_delay_ms(500);
    
    BMA280_Calibrate();
       
    nrf_delay_ms(500);
    
    //save energy - do not need to sample that quickly
    BMA280_Turn_On_Slow();
    
    //Flash memory
    FLASH_Init();
    
    FLASH_Print_ID();
    
    nrf_delay_ms(500);
    
    //FLASH_Reset();    
    //FLASH_Erase();
    
    GLOB_datastart = FLASH_Get_First_Available_Location();
    SEGGER_RTT_printf(0, "First empty page: %d\r\n", GLOB_datastart);
    
    flash_red();
    
    /*
    uint16_t j = 0;
 
    for(j = 0; j < 100; j++) 
    {  
        nrf_delay_ms(100);
        FLASH_Page_Read(j);
    };
    */
       
    /* The four basic functions are to:
     * (1) erase
     * (2) record
     * (3) record + stream data to phone. 
     * (4) get data from phone - especially position and time
     * 
     * We could advertize for two mins after turn on. 
     * If no connection -> record
     * If connection, then would synchronize time, and get occasional GPS packets.
     * Also, would send data to phone app. 
     * In the same app, could chose to delete data
     * Could also flush data to pubnub?
    */ 
    
    RTC1_timer_start();
    
    //controls visibility to bluetooth - not clear to me if advertizing interval is honored
    advertising_start(erase_bonds);
     
    while( 1 ) 
    {
        __WFE();
    };
     
    /*
    for (;;)
        {
            if (NRF_LOG_PROCESS() == false)
            {
                power_manage();
            }
        }
    */
}
